## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (11 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "GITLAB_TOKEN"
                                property = "data.GITLAB_TOKEN"
                            }
                            secretKey = "GITLAB_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "HARBOR_KEY"
                              + property = "data.HARBOR_KEY"
                            }
                          + secretKey = "HARBOR_KEY"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (11 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "GITLAB_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.GITLAB_TOKEN"
                                version            = null
                            }
                            secretKey = "GITLAB_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "HARBOR_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.HARBOR_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "HARBOR_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

#########################################################
##
##   Planning changes for sandbox environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (11 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "GITLAB_TOKEN"
                                property = "data.GITLAB_TOKEN"
                            }
                            secretKey = "GITLAB_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "HARBOR_KEY"
                              + property = "data.HARBOR_KEY"
                            }
                          + secretKey = "HARBOR_KEY"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (11 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "GITLAB_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.GITLAB_TOKEN"
                                version            = null
                            }
                            secretKey = "GITLAB_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "HARBOR_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.HARBOR_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "HARBOR_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  